In [39]:
import psycopg2
import pandas as pd
import numpy as np

In [40]:
from sqlalchemy import create_engine
from sqlalchemy import inspect, func
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
engine = create_engine('postgresql://postgres:postgres@localhost:5432/SQLChallenge')
connection = engine.connect()

In [41]:
connection

In [42]:
inspector=inspect(engine)
inspector.get_table_names()

['Department', 'Titles', 'Employees', 'Salaries', 'Dept_Emp', 'Dept_manager']

In [55]:
# Using the inspector to print the column names within the 'dow' table and its types
columns = inspector.get_columns('Department')
for column in columns:
    print(column["name"], column["type"])

dept_no VARCHAR
dept_name VARCHAR

In [56]:
Base = automap_base()
Base.prepare(engine, reflect=True)

In [103]:
#Print the classes mapped to the base
Base.classes.keys()

['Department', 'Titles', 'Employees', 'Dept_Emp', 'Dept_manager', 'Salaries']

In [104]:
# Assign the classes to seperate variables
Salary=Base.classes.Salaries
Employee = Base.classes.Employees
Department = Base.classes.Department
Title=Base.classes.Titles

In [ ]:
# Create session
session = Session(engine)

In [94]:

emp_data= session.query(Employee.emp_no, Employee.first_name, Employee.last_name, Employee.emp_title).\
    order_by(Employee.emp_no.desc()).all()
#dept_data=session.query(Department.dept_no, Department.dept_name).order_by(Department.dept_no.desc()).all()
title_data=session.query(Title.title_id, Title.title).all()
salary_data=session.query(Salary.emp_no, Salary.salary)

In [105]:
#Create an Employee dataframe
employee_df=pd.DataFrame(emp_data, columns=['emp_no', 'first_name', 'last_name','emp_title'])

In [106]:
#Create a Title dataframe
title_df=pd.DataFrame(title_data, columns=['title_id', 'title'])

In [107]:
merged_df=pd.merge(employee_df,title_df, left_on='emp_title', right_on='title_id', how='left')
del merged_df['title_id']

In [108]:
merged_df.head(10)

   emp_no first_name     last_name emp_title            title
0  499999     Sachin       Tsukuda     e0002         Engineer
1  499998   Patricia       Breugel     s0001            Staff
2  499997    Berhard        Lenart     e0003  Senior Engineer
3  499996       Zito          Baaz     e0003  Senior Engineer
4  499995     Dekang      Lichtner     e0002         Engineer
5  499994      Navin       Argence     e0002         Engineer
6  499993   DeForest  Mullainathan     e0002         Engineer
7  499992     Siamak      Salverda     s0001            Staff
8  499991      Pohua       Sichman     s0001            Staff
9  499990     Khaled       Kohling     e0002         Engineer

In [110]:
salary_data=session.query(Salary.emp_no, Salary.salary)
salary_df=pd.DataFrame(salary_data, columns=['emp_no', 'salary'])
salary_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [111]:
combined_df=pd.merge(merged_df,salary_df, on='emp_no', how='left')

In [112]:
print(len(combined_df))
combined_df.head(10)

300024

   emp_no first_name     last_name emp_title            title      salary
0  499999     Sachin       Tsukuda     e0002         Engineer  $63,707.00
1  499998   Patricia       Breugel     s0001            Staff  $40,000.00
2  499997    Berhard        Lenart     e0003  Senior Engineer  $49,597.00
3  499996       Zito          Baaz     e0003  Senior Engineer  $58,058.00
4  499995     Dekang      Lichtner     e0002         Engineer  $40,000.00
5  499994      Navin       Argence     e0002         Engineer  $40,000.00
6  499993   DeForest  Mullainathan     e0002         Engineer  $40,000.00
7  499992     Siamak      Salverda     s0001            Staff  $43,005.00
8  499991      Pohua       Sichman     s0001            Staff  $43,612.00
9  499990     Khaled       Kohling     e0002         Engineer  $40,000.00

In [177]:
#Create a histogram to visualize the most common salary ranges for employees.
salary_info=combined_df[['emp_no', 'title', 'salary']].copy()
salary_info.loc['salary'] = salary_info['salary'].str.replace('$', '')
salary_info.loc['salary'] = pd.to_numeric(salary_info['salary'], errors ='coerce')
salary_info

          emp_no            title      salary
0       499999.0         Engineer  $63,707.00
1       499998.0            Staff  $40,000.00
2       499997.0  Senior Engineer  $49,597.00
3       499996.0  Senior Engineer  $58,058.00
4       499995.0         Engineer  $40,000.00
...          ...              ...         ...
300020   10004.0  Senior Engineer  $40,054.00
300021   10003.0  Senior Engineer  $40,006.00
300022   10002.0            Staff  $65,828.00
300023   10001.0  Senior Engineer  $60,117.00
salary       NaN              NaN         NaN

[300025 rows x 3 columns]

In [176]:
salary_info.groupby('title').mean()

                           emp_no
title
Assistant Engineer  252992.595373
Engineer            253654.345919
Manager             110780.833333
Senior Engineer     253038.749885
Senior Staff        254481.798969
Staff               253408.503604
Technique Leader    251811.432730